Redmap_To_Fusion/Files/RM_FU/Fusion/Reports/RedEntity/sampleRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:pub="http://xmlns.oracle.com/oxp/service/PublicReportService">
	<soap:Header/>
	<soap:Body>
		<pub:runReport>
			<pub:reportRequest>
				<pub:attributeFormat>csv</pub:attributeFormat>
				<!-- Flatten XML should always be false when we have XML type of output to display the XML tags as mentioned in BIP Data Model and display XML structure in as expected format -->
				<pub:flattenXML>true</pub:flattenXML>
				<pub:parameterNameValues>
					<!--1st Parameter of BIP Report-->
					<pub:item>
						<pub:name>SN</pub:name>
						<pub:values>
							<pub:item>1</pub:item>
						</pub:values>
					</pub:item>
					<pub:item>
						<pub:name>P_VALUE_ENABLE</pub:name>
						<pub:values>
							<pub:item>Enabled</pub:item>
						</pub:values>
					</pub:item>
					<pub:item>
						<pub:name>P_VALUE_TYPE</pub:name>
						<pub:values>
							<pub:item>Child</pub:item>
						</pub:values>
					</pub:item>
					<pub:item>
						<pub:name>P_USER_GROUP</pub:name>
						<pub:values>
							<pub:item>International</pub:item>
						</pub:values>
					</pub:item>
					<pub:item>
						<pub:name>P_VALUESET_VALUES</pub:name>
						<pub:values>
							<pub:item>Redmap Enabled</pub:item>
						</pub:values>
					</pub:item>
				</pub:parameterNameValues>
				<pub:reportAbsolutePath>/Custom/Integration/Reports/SIS COA Segment Values Report.xdo</pub:reportAbsolutePath>
				<!-- Setting sizeOfDataChunkDownload to -1 will return the output to the calling client -->
				<pub:sizeOfDataChunkDownload>-1</pub:sizeOfDataChunkDownload>
			</pub:reportRequest>
		</pub:runReport>
	</soap:Body>
</soap:Envelope>
